esmjihwankim/BSPWon_nRF52832/gpio_control.h
#ifndef _GPIO_CONTROL_H
#define _GPIO_CONTROL_H


#include "app_timer.h"
#include "ble_nus.h"
#include "app_uart.h"
#include "nrf_drv_timer.h"
#include "nrf_drv_clock.h"
#include "helper.h"

#define CONTROL_PIN_1 11
#define CONTROL_PIN_2 12
#define CONTROL_PIN_3 13
#define CONTROL_PIN_4 14

#define CASCADE_PIN_1 11
#define CASCADE_PIN_2 12
#define CASCADE_PIN_3 13
#define CASCADE_PIN_4 14
#define CASCADE_PIN_5 15

#define PULSE_PIN_1 4
#define PULSE_PIN_2 5
#define PULSE_PIN_3 7
#define PULSE_PIN_4 9
#define PULSE_PIN_5 11
#define PULSE_PIN_6 12
#define PULSE_PIN_7 13
#define PULSE_PIN_8 14
#define PULSE_PIN_9 15
#define PULSE_PIN_10 22
#define PULSE_PIN_11 23
#define PULSE_PIN_12 24

#define CASCADE_INTERVAL APP_TIMER_TICKS(100)

APP_TIMER_DEF(m_app_timer_id);
void gpio_init(void);
void control_table(ble_nus_evt_t * p_evt);
void led_on(void); 
void led_off(void);
void led_cascade_on(void);
void led_cascade_off(void);
void led_toggle(void);



#endif